app/controllers/restaurants_controller.rb

  def index
    @all_restaurants = Restaurant.all
---
SELECT "restaurants".* FROM "restaurants"

  def create
    @restaurant = Restaurant.new(restaurant_params)
    if @restaurant.save
---
INSERT INTO "restaurants" ("address", "category", "city", "created_at", "description", "name", "state", "updated_at", "zipcode") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def show
    @restaurant = Restaurant.find(params[:id])
    @reviews = Review.where(restaurant_id: @restaurant[:id])
---
SELECT  "restaurants".* FROM "restaurants"  WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 4]]
SELECT "reviews".* FROM "reviews"  WHERE "reviews"."restaurant_id" = 2