app/controllers/reviews_controller.rb

SELECT  "restaurants".* FROM "restaurants"  WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 2]]
---
    def new
      @review = Review.new
      @restaurant = Restaurant.find(params[:restaurant_id])

SELECT  "restaurants".* FROM "restaurants"  WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 2]]
INSERT INTO "reviews" ("body", "created_at", "rating", "restaurant_id", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "Okay food"], ["created_at", "2014-12-19 16:37:44.997288"], ["rating", 2], ["restaurant_id", 2], ["updated_at", "2014-12-19 16:37:44.997288"]]
---
    def create
      @review = Review.new(review_params)
      @restaurant = Restaurant.find(params[:restaurant_id])
      @review.restaurant_id = params[:restaurant_id]

      if @review.save